IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 I   PIC 9(2) VALUE 0.
01 SQ  PIC 9(4) VALUE 0.

PROCEDURE DIVISION.
    DISPLAY "Hello from COBOL".
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        COMPUTE SQ = I * I
        DISPLAY I " squared is " SQ
    END-PERFORM.
    STOP RUN.
